# Taps
tap "oven-sh/bun"

# CLI Tools
brew "ast-grep"
brew "bat"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "htop"
brew "httpie"
brew "jq"
brew "neovim"
brew "fnm"
brew "opencode"
brew "pnpm"
brew "ripgrep"
brew "starship"
brew "wget"
brew "yq"
brew "zoxide"
brew "oven-sh/bun/bun"

# Apps
cask "1password"
cask "1password-cli"
cask "beeper"
cask "claude"
cask "cleanshot-x"
cask "cursor"
cask "discord"
cask "figma"
cask "firefox"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "granola"
cask "linear"
cask "notion"
cask "raycast"
cask "slack"
cask "spotify"
cask "superhuman"
cask "superwhisper"

# Fonts
cask "font-jetbrains-mono-nerd-font"
